In [2]:
import pandas as pd

In [3]:
my_series = pd.Series(["banana", 42, True, 3.14])

In [4]:
my_series

0    banana
1        42
2      True
3      3.14
dtype: object

In [5]:
type(my_series)

pandas.core.series.Series

In [8]:
my_series = pd.Series(
    ["banana", 42, True, 3.14],
    index=["string", "integer", "boolean", "float"]
)
my_series

string     banana
integer        42
boolean      True
float        3.14
dtype: object

In [9]:
my_series.loc["string"]

'banana'

In [10]:
my_series.loc["float"]

3.14

In [11]:
type(my_series.loc["float"])

float

In [12]:
my_series.loc[0]

KeyError: 0

In [13]:
my_series.iloc[0]

'banana'

In [17]:
scientists = pd.DataFrame(
    data={'Occupation':['Chemist','Statistician'],
          'Born':['1920-07-25', '1876-06-13'],
          'Died':['1958-04-16', '1937-10-16'],
          'Age':[37,61]},
    index=['Rosaline Franklin','William Gosset'],
    columns=['Age', 'Occupation', 'Born','Died'])
scientists

                   Age    Occupation        Born        Died
Rosaline Franklin   37       Chemist  1920-07-25  1958-04-16
William Gosset      61  Statistician  1876-06-13  1937-10-16

In [19]:
{"name": "daniel", "lname": "chen"}

{'name': 'daniel', 'lname': 'chen'}

In [20]:
scientists = pd.read_csv("data/scientists.csv")

In [21]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [22]:
scientists["Age"]

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [23]:
scientists.Age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [26]:
ages = scientists.Age
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [27]:
ages.shape

(8,)

In [29]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [30]:
ages.mean()

59.125

In [31]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [33]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [36]:
scientists.loc[ages > ages.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [37]:
scientists.loc[ages > ages.mean() and ages < 75]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [38]:
scientists.loc[ages > ages.mean() & ages < 75]

TypeError: Cannot perform 'rand_' with a dtyped [int64] array and scalar of type [bool]

In [39]:
scientists.loc[(ages > ages.mean()) & (ages < 75)]

             Name        Born        Died  Age    Occupation
1  William Gosset  1876-06-13  1937-10-16   61  Statistician
3     Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [40]:
scientists.loc[(ages > ages.mean()) | (ages < 75)]

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [42]:
scientists.loc[(ages > ages.mean()) & !(ages < 75)]

SyntaxError: invalid syntax (2984585451.py, line 1)

In [43]:
scientists.loc[(ages > ages.mean()) & ~(ages < 75)]

                   Name        Born        Died  Age     Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [44]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [47]:
scientists.loc[(scientists.Age > scientists.Age.mean()) & ~(scientists.Age < 75), :]

                   Name        Born        Died  Age     Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [48]:
scientists.loc[(scientists.Age > scientists.Age.mean()) & ~(scientists.Age < 75), ["Name", "Age"]]

                   Name  Age
2  Florence Nightingale   90
7          Johann Gauss   77

In [50]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [51]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [56]:
pd.to_datetime(scientists["Born"], format="%Y-%m-%d").dt.year

0    1920
1    1876
2    1820
3    1867
4    1907
5    1813
6    1912
7    1777
Name: Born, dtype: int64

In [58]:
scientists["born_dt"] = pd.to_datetime(scientists["Born"], format="%Y-%m-%d")

In [59]:
scientists

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [61]:
sub = scientists.loc[scientists.Age < 60]
sub

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23

In [62]:
sub["died_dt"] =  pd.to_datetime(scientists["Died"], format="%Y-%m-%d")

C:\Users\Danie\AppData\Local\Temp\ipykernel_20540\3154232017.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sub["died_dt"] =  pd.to_datetime(scientists["Died"], format="%Y-%m-%d")

In [63]:
scientists

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [64]:
sub

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07

In [67]:
sub = scientists.loc[scientists.Age < 60].copy()
sub["died_dt"] =  pd.to_datetime(scientists["Died"], format="%Y-%m-%d")
sub

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07

In [75]:
scientists.to_csv("scientists_out.csv", index=False)

In [72]:
scientists.to_csv("scientists_out.csv")

In [76]:
reload = pd.read_csv("scientists_out.csv")
reload

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [77]:
scientists.to_json()

'{"Name":{"0":"Rosaline Franklin","1":"William Gosset","2":"Florence Nightingale","3":"Marie Curie","4":"Rachel Carson","5":"John Snow","6":"Alan Turing","7":"Johann Gauss"},"Born":{"0":"1920-07-25","1":"1876-06-13","2":"1820-05-12","3":"1867-11-07","4":"1907-05-27","5":"1813-03-15","6":"1912-06-23","7":"1777-04-30"},"Died":{"0":"1958-04-16","1":"1937-10-16","2":"1910-08-13","3":"1934-07-04","4":"1964-04-14","5":"1858-06-16","6":"1954-06-07","7":"1855-02-23"},"Age":{"0":37,"1":61,"2":90,"3":66,"4":56,"5":45,"6":41,"7":77},"Occupation":{"0":"Chemist","1":"Statistician","2":"Nurse","3":"Chemist","4":"Biologist","5":"Physician","6":"Computer Scientist","7":"Mathematician"},"born_dt":{"0":-1560124800000,"1":-2952201600000,"2":-4722192000000,"3":-3223584000000,"4":-1975536000000,"5":-4948128000000,"6":-1815350400000,"7":-6080140800000}}'

In [80]:
scientists.to_json("scientists_out.json", orient="table", indent=2)